tylertms/dspic33e-sim/conformance/oscillator.c
#include <inttypes.h>
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>

#include "device.h"
#include "dspic33.h"

enum {
    OSCILLATOR_CONTROL = 0x0742u,
    OSCILLATOR_SWITCH_ENABLE = 0x0001u,
    OSCILLATOR_LP_ENABLE = 0x0002u,
    OSCILLATOR_CLOCK_FAIL = 0x0008u,
    OSCILLATOR_PLL_LOCK = 0x0020u,
    OSCILLATOR_IO_LOCK = 0x0040u,
    OSCILLATOR_CLOCK_LOCK = 0x0080u,
    OSCILLATOR_SWITCH_DELAY = 32u,
    REFERENCE_CLOCK_CONTROL = 0x074eu,
    REFERENCE_CLOCK_ENABLE = 0x8000u,
    REFERENCE_CLOCK_SLEEP = 0x2000u,
    REFERENCE_CLOCK_SOURCE = 0x1000u,
    REFERENCE_CLOCK_DIVISOR = 0x0f00u,
    MAIN_CLOCK_DIVISOR = 0x0744u,
    MAIN_CLOCK_RECOVER_INTERRUPT = 0x8000u,
    MAIN_CLOCK_DOZE_MASK = 0x7000u,
    MAIN_CLOCK_DOZE_ENABLE = 0x0800u,
    MAIN_PLL_FEEDBACK = 0x0746u,
    MAIN_OSCILLATOR_TUNING = 0x0748u,
    TIMER1_COUNTER = 0x0100u,
    TIMER1_PERIOD = 0x0102u,
    TIMER1_CONTROL = 0x0104u,
    CRC_PMD_ADDRESS = 0x0764u,
    CRC_PMD = 0x0080u,
    CONFIGURATION_FOSCSEL = 0xf80006u,
    CONFIGURATION_FOSC = 0xf80008u,
    CONFIGURATION_FWDT = 0xf8000au,
    OPCODE_NOP = 0x000000u,
    OPCODE_SLEEP = 0xfe4000u,
    OPCODE_RESET = 0xfe0000u,
    OPCODE_GOTO_W0 = 0x010400u,
    OPCODE_MOV_IFS0_W2 = 0x804002u,
    OPCODE_MOV_W0_W1 = 0x780880u,
    OPCODE_MOV_BYTE_W0_W1 = 0x784880u,
    OPCODE_MOV_BYTE_W2_W1 = 0x784882u,
    OPCODE_MOV_BYTE_W3_W1 = 0x784883u
};

typedef struct {
    uint32_t cases;
    uint32_t passed;
    uint32_t failed;
} OscillatorConformance;

static void expect(OscillatorConformance* state, bool condition, const char* name) {
    state->cases++;
    if (condition) {
        state->passed++;
    } else {
        state->failed++;
        printf("[oscillator-failed] %s\n", name);
    }
}

static uint16_t control(Dspic33* cpu) {
    return dspic33_read_word(cpu, OSCILLATOR_CONTROL);
}

static bool load_sequence(Dspic33* cpu, uint32_t first, uint32_t second,
                          uint32_t third) {
    return dspic33_load_program_word(cpu, 0x0020u, first) &&
           dspic33_load_program_word(cpu, 0x0022u, second) &&
           dspic33_load_program_word(cpu, 0x0024u, third);
}

static Dspic33StopReason write_protected_byte(Dspic33* cpu, uint16_t address,
                                              uint8_t value) {
    uint8_t first = address == OSCILLATOR_CONTROL ? 0x46u : 0x78u;
    uint8_t second = address == OSCILLATOR_CONTROL ? 0x57u : 0x9au;
    load_sequence(cpu, OPCODE_MOV_BYTE_W2_W1, OPCODE_MOV_BYTE_W3_W1,
                  OPCODE_MOV_BYTE_W0_W1);
    cpu->pc = 0x0020u;
    dspic33_set_working_register(cpu, 0u, value);
    dspic33_set_working_register(cpu, 1u, address);
    dspic33_set_working_register(cpu, 2u, first);
    dspic33_set_working_register(cpu, 3u, second);
    if (dspic33_step(cpu) != DSPIC33_RUNNING || dspic33_step(cpu) != DSPIC33_RUNNING) {
        return cpu->stop_reason;
    }
    return dspic33_step(cpu);
}

static bool program_fosc(Dspic33* cpu, uint8_t value) {
    cpu->nvm.control = 0u;
    cpu->nvm.address = CONFIGURATION_FOSC;
    cpu->nvm.latches[0] = value;
    dspic33_complete_nvm(cpu);
    return dspic33_read_configuration_byte(cpu, CONFIGURATION_FOSC) == value;
}

static bool program_foscsel(Dspic33* cpu, uint8_t value) {
    cpu->nvm.control = 0u;
    cpu->nvm.address = CONFIGURATION_FOSCSEL;
    cpu->nvm.latches[0] = value;
    dspic33_complete_nvm(cpu);
    return dspic33_read_configuration_byte(cpu, CONFIGURATION_FOSCSEL) == value;
}

static bool program_fwdt(Dspic33* cpu, uint8_t value) {
    cpu->nvm.control = 0u;
    cpu->nvm.address = CONFIGURATION_FWDT;
    cpu->nvm.latches[0] = value;
    dspic33_complete_nvm(cpu);
    return dspic33_read_configuration_byte(cpu, CONFIGURATION_FWDT) == value;
}

static bool select_locked_main_pll(Dspic33* cpu, uint8_t source) {
    dspic33_load_configuration_word(cpu, CONFIGURATION_FOSCSEL, 0x0078u);
    dspic33_load_configuration_word(cpu, CONFIGURATION_FOSC, 0x005eu);
    dspic33_load_configuration_word(cpu, CONFIGURATION_FWDT, 0x00ffu);
    dspic33_reset(cpu, 0u);
    if (write_protected_byte(cpu, OSCILLATOR_CONTROL + 1u, source) != DSPIC33_RUNNING ||
        write_protected_byte(cpu, OSCILLATOR_CONTROL, OSCILLATOR_SWITCH_ENABLE) !=
            DSPIC33_RUNNING ||
        !dspic33_device_advance(cpu, OSCILLATOR_SWITCH_DELAY)) {
        return false;
    }
    return control(cpu) == (uint16_t)(source * 0x1100u + OSCILLATOR_PLL_LOCK);
}

static void reset_cases(OscillatorConformance* state, Dspic33* cpu) {
    expect(state, dspic33_load_configuration_word(cpu, 0xf80006u, 0x00ffu),
           "load nondefault FNOSC configuration");
    dspic33_reset(cpu, 0u);
    expect(state, control(cpu) == 0x7700u,
           "POR immediately selects ready internal FNOSC source");
    expect(state, (control(cpu) & OSCILLATOR_PLL_LOCK) == 0u,
           "POR internal source has no PLL lock status");
    expect(state, cpu->oscillator.generation == 0u && !cpu->oscillator.active,
           "POR clears oscillator lifecycle state");
    expect(state, cpu->events.count == 0u, "POR leaves no oscillator event");

    expect(state, dspic33_load_configuration_word(cpu, 0xf80006u, 0x0078u),
           "restore firmware FNOSC configuration");
    dspic33_reset(cpu, 0u);
    expect(state, control(cpu) == 0u, "firmware configuration starts from FRC");
}

static void protection_cases(OscillatorConformance* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, OSCILLATOR_CONTROL, 0xffffu);
    expect(state, control(cpu) == 0u, "word write cannot unlock OSCCON");
    dspic33_write_byte(cpu, OSCILLATOR_CONTROL + 1u, 0x03u);
    expect(state, control(cpu) == 0u, "direct byte write cannot unlock OSCCON");
    expect(state,
           write_protected_byte(cpu, OSCILLATOR_CONTROL + 1u, 0x03u) == DSPIC33_RUNNING,
           "high-byte unlock sequence executes");
    expect(state, control(cpu) == 0x0300u, "high-byte unlock writes NOSC only");
    expect(state,
           write_protected_byte(cpu, OSCILLATOR_CONTROL, 0x42u) == DSPIC33_RUNNING,
           "low-byte unlock sequence executes");
    expect(state, control(cpu) == 0x0342u, "low-byte unlock writes IOLOCK and LPOSCEN");
    expect(state,
           write_protected_byte(cpu, OSCILLATOR_CONTROL, 0x80u) == DSPIC33_RUNNING,
           "CLKLOCK set sequence executes");
    expect(state, control(cpu) == 0x0380u, "CLKLOCK sets and other controls clear");
    expect(state, write_protected_byte(cpu, OSCILLATOR_CONTROL, 0u) == DSPIC33_RUNNING,
           "CLKLOCK clear attempt executes");
    expect(state, control(cpu) == 0x0380u, "CLKLOCK is software set-only");

    dspic33_reset(cpu, 0u);
    load_sequence(cpu, OPCODE_MOV_BYTE_W2_W1, OPCODE_NOP, OPCODE_MOV_BYTE_W3_W1);
    dspic33_load_program_word(cpu, 0x0026u, OPCODE_MOV_BYTE_W0_W1);
    cpu->pc = 0x0020u;
    dspic33_set_working_register(cpu, 0u, 0x40u);
    dspic33_set_working_register(cpu, 1u, OSCILLATOR_CONTROL);
    dspic33_set_working_register(cpu, 2u, 0x46u);
    dspic33_set_working_register(cpu, 3u, 0x57u);
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING, "delayed key first write");
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING, "delayed key intervening NOP");
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING, "delayed key second write");
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING, "delayed key final write");
    expect(state, control(cpu) == 0u, "intervening instruction invalidates key");

    dspic33_reset(cpu, 0u);
    load_sequence(cpu, OPCODE_MOV_BYTE_W2_W1, OPCODE_MOV_BYTE_W3_W1,
                  OPCODE_MOV_BYTE_W0_W1);
    cpu->pc = 0x0020u;
    dspic33_set_working_register(cpu, 0u, 0x40u);
    dspic33_set_working_register(cpu, 1u, OSCILLATOR_CONTROL);
    dspic33_set_working_register(cpu, 2u, 0x46u);
    dspic33_set_working_register(cpu, 3u, 0x56u);
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING, "wrong key first write");
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING, "wrong key second write");
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING, "wrong key final write");
    expect(state, control(cpu) == 0u, "wrong second key blocks write");

    dspic33_reset(cpu, 0u);
    load_sequence(cpu, OPCODE_MOV_BYTE_W2_W1, OPCODE_MOV_BYTE_W3_W1,
                  OPCODE_MOV_BYTE_W0_W1);
    cpu->pc = 0x0020u;
    dspic33_set_working_register(cpu, 0u, 0x40u);
    dspic33_set_working_register(cpu, 1u, OSCILLATOR_CONTROL);
    dspic33_set_working_register(cpu, 2u, 0x46u);
    dspic33_set_working_register(cpu, 3u, 0x57u);
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING, "interrupt key first write");
    cpu->interrupt_count++;
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING, "interrupt key second write");
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING, "interrupt key final write");
    expect(state, control(cpu) == 0u, "interrupt entry invalidates key");
}

static void switch_cases(OscillatorConformance* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    cpu->data[OSCILLATOR_CONTROL] = OSCILLATOR_CLOCK_FAIL;
    expect(state,
           write_protected_byte(cpu, OSCILLATOR_CONTROL + 1u, 0x03u) == DSPIC33_RUNNING,
           "firmware high-byte clock request executes");
    expect(state,
           write_protected_byte(cpu, OSCILLATOR_CONTROL, OSCILLATOR_SWITCH_ENABLE) ==
               DSPIC33_RUNNING,
           "firmware low-byte switch request executes");
    expect(state, control(cpu) == 0x0301u,
           "switch starts with requested source and cleared status");
    expect(state, cpu->oscillator.active && cpu->events.count == 1u,
           "switch schedules one active event");
    expect(state, cpu->oscillator.generation == 1u,
           "switch advances oscillator generation");
    expect(state, dspic33_device_advance(cpu, OSCILLATOR_SWITCH_DELAY - 2u),
           "advance before modeled switch deadline");
    expect(state, control(cpu) == 0x0301u,
           "switch remains pending before modeled deadline");
    expect(state, dspic33_device_advance(cpu, 1u),
           "advance to modeled switch deadline");
    expect(state, control(cpu) == 0x3320u,
           "POSCPLL switch transfers COSC and sets LOCK");
    expect(state, !cpu->oscillator.active && cpu->events.count == 0u,
           "switch completion clears lifecycle state");

    dspic33_reset(cpu, 0u);
    expect(state,
           write_protected_byte(cpu, OSCILLATOR_CONTROL, OSCILLATOR_SWITCH_ENABLE) ==
               DSPIC33_RUNNING,
           "redundant switch request executes");
    expect(state, control(cpu) == 0u && cpu->events.count == 0u,
           "redundant switch clears OSWEN without event");

    write_protected_byte(cpu, OSCILLATOR_CONTROL + 1u, 0x03u);
    write_protected_byte(cpu, OSCILLATOR_CONTROL, OSCILLATOR_SWITCH_ENABLE);
    expect(state, cpu->oscillator.active, "abort case starts active switch");
    expect(state, write_protected_byte(cpu, OSCILLATOR_CONTROL, 0u) == DSPIC33_RUNNING,
           "explicit switch abort executes");
    expect(state, !cpu->oscillator.active && (control(cpu) & 1u) == 0u,
           "explicit switch abort clears OSWEN");
    expect(state, dspic33_device_advance(cpu, OSCILLATOR_SWITCH_DELAY),
           "advance through stale aborted event");
    expect(state, (control(cpu) & 0x7021u) == 0u,
           "aborted event cannot change source or lock");

    write_protected_byte(cpu, OSCILLATOR_CONTROL + 1u, 0x03u);
    write_protected_byte(cpu, OSCILLATOR_CONTROL, OSCILLATOR_SWITCH_ENABLE);
    expect(state, cpu->oscillator.active, "replacement case starts first switch");
    write_protected_byte(cpu, OSCILLATOR_CONTROL + 1u, 0x02u);
    expect(state, !cpu->oscillator.active && control(cpu) == 0x0200u,
           "new source request aborts active switch");
    write_protected_byte(cpu, OSCILLATOR_CONTROL, OSCILLATOR_SWITCH_ENABLE);
    expect(state, cpu->oscillator.active && cpu->events.count == 2u,
           "second switch retains stale event for generation check");
    expect(state, dspic33_device_advance(cpu, 25u) && control(cpu) == 0x0201u,
           "stale first completion cannot finish second switch");
    expect(state, cpu->events.count == 1u && cpu->oscillator.active,
           "stale completion preserves current switch event");
    expect(state, dspic33_device_advance(cpu, 6u) && control(cpu) == 0x2200u,
           "second non-PLL switch completes without LOCK");

    write_protected_byte(cpu, OSCILLATOR_CONTROL + 1u, 0x03u);
    write_protected_byte(cpu, OSCILLATOR_CONTROL, OSCILLATOR_SWITCH_ENABLE);
    dspic33_load_program_word(cpu, 0x0020u, OPCODE_SLEEP);
    cpu->pc = 0x0020u;
    expect(state, dspic33_step(cpu) == DSPIC33_SLEEPING,
           "Sleep executes during clock switch");
    expect(state, !cpu->oscillator.active && (control(cpu) & 1u) == 0u,
           "Sleep aborts clock switch");

    dspic33_reset(cpu, 0u);
    write_protected_byte(cpu, OSCILLATOR_CONTROL, OSCILLATOR_CLOCK_LOCK);
    write_protected_byte(cpu, OSCILLATOR_CONTROL + 1u, 0x03u);
    write_protected_byte(cpu, OSCILLATOR_CONTROL,
                         OSCILLATOR_CLOCK_LOCK | OSCILLATOR_SWITCH_ENABLE);
    expect(state, control(cpu) == 0x0080u, "CLKLOCK blocks subsequent source switch");
    expect(state, cpu->events.count == 0u && !cpu->oscillator.active,
           "CLKLOCK rejection schedules no switch");
    write_protected_byte(cpu, OSCILLATOR_CONTROL,
                         OSCILLATOR_CLOCK_LOCK | OSCILLATOR_LP_ENABLE);
    expect(state, control(cpu) == 0x0080u, "CLKLOCK blocks LPOSCEN changes");
}

static void failure_trap_cases(OscillatorConformance* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    dspic33_load_program_word(cpu, 0x0004u, 0x000100u);
    dspic33_set_working_register(cpu, 15u, 0x2000u);
    cpu->stop_on_trap = true;
    expect(state,
           write_protected_byte(cpu, OSCILLATOR_CONTROL, OSCILLATOR_CLOCK_FAIL) ==
               DSPIC33_TRAPPED,
           "CF write one dispatches oscillator-fail trap");
    expect(state, (control(cpu) & OSCILLATOR_CLOCK_FAIL) != 0u,
           "oscillator-fail trap leaves CF set");
    expect(state, (dspic33_read_word(cpu, 0x08c0u) & 0x0002u) != 0u,
           "oscillator-fail trap sets OSCFAIL status");
    expect(state, cpu->last_trap == 0u && cpu->last_trap_return == 0x0026u,
           "oscillator-fail trap records source and return PC");
    expect(state,
           dspic33_read_word(cpu, 0x2000u) == 0x0026u &&
               (dspic33_read_word(cpu, 0x2002u) & 0x007fu) == 0u,
           "oscillator-fail trap stacks return address");
    expect(state, cpu->pc == 0x000100u && cpu->w[15] == 0x2004u,
           "oscillator-fail trap enters vector four");
    dspic33_reset(cpu, 0u);
    cpu->data[OSCILLATOR_CONTROL] = OSCILLATOR_CLOCK_FAIL;
    expect(state, write_protected_byte(cpu, OSCILLATOR_CONTROL, 0u) == DSPIC33_RUNNING,
           "CF clear sequence executes");
    expect(state, (control(cpu) & OSCILLATOR_CLOCK_FAIL) == 0u,
           "CF write zero clears failure flag");
}

static void configuration_admission_cases(OscillatorConformance* state, Dspic33* cpu) {
    static const uint8_t disabled_configurations[] = {0x9eu, 0xdeu};
    size_t index;
    for (index = 0u;
         index < sizeof(disabled_configurations) / sizeof(disabled_configurations[0]);
         index++) {
        dspic33_load_configuration_word(cpu, CONFIGURATION_FOSC,
                                        disabled_configurations[index]);
        dspic33_reset(cpu, 0u);
        write_protected_byte(cpu, OSCILLATOR_CONTROL + 1u, 0x02u);
        write_protected_byte(cpu, OSCILLATOR_CONTROL, OSCILLATOR_SWITCH_ENABLE);
        expect(state, control(cpu) == 0x0200u,
               "FCKSM disabled mode rejects software switch");
        expect(state, !cpu->oscillator.active && cpu->events.count == 0u,
               "FCKSM rejection schedules no switch");
    }

