tylertms/dspic33e-sim/conformance/oscillator.c
    dspic33_load_configuration_word(source, CONFIGURATION_FOSCSEL, 0x00fbu);
    dspic33_reset(source, 0u);
    generation = source->oscillator.generation;
    dspic33_write_word(source, MAIN_PLL_FEEDBACK, 0x0031u);
    expect(state,
           control(source) == 0x0300u && source->oscillator.active &&
               source->oscillator.automatic && !source->oscillator.source_ready &&
               source->oscillator.generation == generation + 1u,
           "pre-source PLL change restarts switch generation");
    expect(state,
           dspic33_device_advance(source, 1u) && source->oscillator.source_ready &&
               source->oscillator.lock_pending,
           "restarted PLL switch reaches source-ready phase");
    expect(state, dspic33_device_advance(source, 31u) && control(source) == 0x3320u,
           "restarted PLL switch locks and transfers");

    dspic33_load_configuration_word(source, CONFIGURATION_FOSCSEL, 0x0078u);
    dspic33_reset(source, 0u);
    write_protected_byte(source, OSCILLATOR_CONTROL + 1u, 3u);
    write_protected_byte(source, OSCILLATOR_CONTROL, OSCILLATOR_SWITCH_ENABLE);
    dspic33_device_advance(source, 1u);
    generation = source->oscillator.generation;
    deadline = source->events.items[0].cycle;
    dspic33_write_word(source, MAIN_PLL_FEEDBACK, 0x0031u);
    expect(state,
           source->oscillator.active && source->oscillator.source_ready &&
               source->oscillator.lock_pending &&
               source->oscillator.generation == generation + 1u &&
               source->events.items[source->events.count - 1u].cycle ==
                   source->device_cycles + OSCILLATOR_SWITCH_DELAY &&
               source->events.items[0].cycle == deadline,
           "source-ready PLL change replaces lock deadline and leaves stale event");
    expect(state, dspic33_device_advance(source, 31u) && control(source) == 0x0301u,
           "stale source-ready lock event cannot transfer");
    expect(state, dspic33_device_advance(source, 1u) && control(source) == 0x3320u,
           "replacement source-ready lock event transfers");

    dspic33_load_configuration_word(source, CONFIGURATION_FWDT, 0x00dfu);
    dspic33_reset(source, 0u);
    write_protected_byte(source, OSCILLATOR_CONTROL + 1u, 1u);
    write_protected_byte(source, OSCILLATOR_CONTROL, OSCILLATOR_SWITCH_ENABLE);
    dspic33_device_advance(source, 1u);
    generation = source->oscillator.generation;
    dspic33_write_word(source, MAIN_OSCILLATOR_TUNING, 0x0001u);
    expect(state,
           control(source) == 0x1100u && !source->oscillator.active &&
               source->oscillator.lock_pending &&
               source->oscillator.generation == generation + 1u,
           "PLLK zero post-transfer change replaces lock deadline");
    expect(state, dspic33_device_advance(source, 31u) && control(source) == 0x1100u,
           "stale PLLK zero lock event cannot lock");
    expect(state, dspic33_device_advance(source, 1u) && control(source) == 0x1120u,
           "replacement PLLK zero event locks");

    dspic33_load_configuration_word(source, CONFIGURATION_FWDT, 0x00ffu);
    expect(state, select_locked_main_pll(source, 1u),
           "select FRCPLL for prohibited direct transition");
    write_protected_byte(source, OSCILLATOR_CONTROL + 1u, 3u);
    write_protected_byte(source, OSCILLATOR_CONTROL, OSCILLATOR_SWITCH_ENABLE);
    generation = source->oscillator.generation;
    dspic33_write_word(source, MAIN_PLL_FEEDBACK, 0x0031u);
    expect(state,
           control(source) == 0x1321u && source->oscillator.active &&
               source->oscillator.generation == generation &&
               source->events.count == 0u,
           "PLL register write cannot complete prohibited direct transition");
    expect(state, dspic33_device_advance(source, 32u) && control(source) == 0x1321u,
           "prohibited direct transition remains pending after PLL write");

    expect(state, select_locked_main_pll(source, 1u),
           "select FRCPLL for switch-away configuration change");
    generation = source->oscillator.generation;
    dspic33_write_word(source, MAIN_PLL_FEEDBACK, 0x0030u);
    expect(state,
           control(source) == 0x1120u && source->oscillator.generation == generation &&
               source->events.count == 0u,
           "unchanged PLL configuration preserves lock lifecycle");
    write_protected_byte(source, OSCILLATOR_CONTROL + 1u, 2u);
    write_protected_byte(source, OSCILLATOR_CONTROL, OSCILLATOR_SWITCH_ENABLE);
    generation = source->oscillator.generation;
    deadline = source->events.items[0].cycle;
    dspic33_write_word(source, MAIN_PLL_FEEDBACK, 0x0031u);
    expect(state,
           control(source) == 0x1201u && source->oscillator.active &&
               source->oscillator.generation == generation &&
               source->events.count == 1u && source->events.items[0].cycle == deadline,
           "PLL change while switching away preserves destination readiness");
    expect(state, dspic33_device_advance(source, 31u) && control(source) == 0x2200u,
           "switch away from PLL completes after configuration change");

    expect(state, select_locked_main_pll(source, 1u),
           "select FRCPLL for relock lifecycle");
    dspic33_write_word(source, MAIN_PLL_FEEDBACK, 0x0031u);
    dspic33_device_advance(source, 10u);
    expect(state, dspic33_copy(copy, source), "copy preserves main PLL relock");
    expect(state,
           copy->oscillator.lock_pending && copy->events.count == 1u &&
               dspic33_device_advance(source, 22u) && control(source) == 0x1120u &&
               dspic33_device_advance(copy, 22u) && control(copy) == 0x1120u,
           "copied main PLL relocks complete independently");

    dspic33_write_word(source, MAIN_PLL_FEEDBACK, 0x0032u);
    dspic33_device_advance(source, 10u);
    dspic33_load_program_word(source, 0u, OPCODE_RESET);
    source->pc = 0u;
    expect(state,
           dspic33_step(source) == DSPIC33_RUNNING && source->oscillator.lock_pending &&
               source->events.count == 1u && control(source) == 0x1100u,
           "warm reset reconstructs main PLL relock");
    expect(state, dspic33_device_advance(source, 21u) && control(source) == 0x1120u,
           "warm-reset main PLL relock keeps remaining deadline");

