tylertms/dspic33e-sim/conformance/oscillator.c
    dspic33_write_word(source, MAIN_PLL_FEEDBACK, 0x0033u);
    dspic33_reset(source, 0u);
    expect(state,
           control(source) == 0u && !source->oscillator.lock_pending &&
               source->events.count == 0u &&
               dspic33_read_word(source, MAIN_PLL_FEEDBACK) == 0x0030u,
           "cold reset cancels relock and restores PLL configuration");

    expect(state, select_locked_main_pll(source, 1u),
           "select FRCPLL for relock schedule failure");
    source->device_cycles = UINT64_MAX;
    dspic33_write_word(source, MAIN_PLL_FEEDBACK, 0x0031u);
    expect(state,
           source->stop_reason == DSPIC33_EVENT_QUEUE_ERROR &&
               control(source) == 0x1100u && source->oscillator.lock_pending &&
               source->events.count == 0u,
           "main PLL relock schedule failure is explicit and deterministic");

    dspic33_load_configuration_word(source, CONFIGURATION_FOSCSEL, 0x0078u);
    dspic33_load_configuration_word(source, CONFIGURATION_FOSC, 0x005eu);
    dspic33_load_configuration_word(source, CONFIGURATION_FWDT, 0x00ffu);
}

static void configure_doze_interrupt(Dspic33* cpu, uint8_t priority) {
    dspic33_write_word(cpu, 0x0820u, 1u);
    dspic33_write_word(cpu, 0x0840u, priority);
    dspic33_load_program_word(cpu, 0x0014u, 0x0100u);
    dspic33_load_program_word(cpu, 0x0100u, OPCODE_NOP);
    dspic33_set_working_register(cpu, 15u, 0x1800u);
    dspic33_raise_interrupt(cpu, 0u);
}

static void doze_cases(OscillatorConformance* state, Dspic33* source, Dspic33* copy) {
    uint64_t cpu_cycles;
    uint64_t device_cycles;
    uint8_t divisor;
    Dspic33StopReason trap_result;

    dspic33_reset(source, 0u);
    dspic33_write_word(source, MAIN_CLOCK_DIVISOR, 0x7800u);
    expect(state, dspic33_read_word(source, MAIN_CLOCK_DIVISOR) == 0x7800u,
           "disabled DOZE field and DOZEN set together");
    dspic33_write_word(source, MAIN_CLOCK_DIVISOR, 0x1800u);
    expect(state, dspic33_read_word(source, MAIN_CLOCK_DIVISOR) == 0x7800u,
           "enabled DOZE field ignores writes");
    dspic33_write_word(source, MAIN_CLOCK_DIVISOR, 0x1000u);
    expect(state, dspic33_read_word(source, MAIN_CLOCK_DIVISOR) == 0x7000u,
           "combined disable and divisor write preserves enabled divisor");
    dspic33_write_word(source, MAIN_CLOCK_DIVISOR, 0x1000u);
    expect(state, dspic33_read_word(source, MAIN_CLOCK_DIVISOR) == 0x1000u,
           "disabled DOZE field accepts a subsequent write");
    dspic33_write_word(source, MAIN_CLOCK_DIVISOR, MAIN_CLOCK_DOZE_ENABLE);
    expect(state, dspic33_read_word(source, MAIN_CLOCK_DIVISOR) == 0u,
           "DOZEN cannot set at the one-to-one ratio");
    dspic33_write_byte(source, MAIN_CLOCK_DIVISOR + 1u, 0x38u);
    expect(state, dspic33_read_word(source, MAIN_CLOCK_DIVISOR) == 0x3800u,
           "high-byte write sets a disabled DOZE ratio");
    dspic33_write_byte(source, MAIN_CLOCK_DIVISOR + 1u, 0x18u);
    expect(state, dspic33_read_word(source, MAIN_CLOCK_DIVISOR) == 0x3800u,
           "high-byte write preserves an enabled DOZE field");

    for (divisor = 1u; divisor <= 7u; divisor++) {
        uint64_t ratio = UINT64_C(1) << divisor;
        dspic33_reset(source, 0u);
        dspic33_write_word(source, MAIN_CLOCK_DIVISOR,
                           (uint16_t)((uint16_t)divisor << 12u) |
                               MAIN_CLOCK_DOZE_ENABLE);
        dspic33_load_program_word(source, 0u, OPCODE_NOP);
        source->pc = 0u;
        cpu_cycles = source->cycles;
        device_cycles = source->device_cycles;
        expect(state,
               dspic33_step(source) == DSPIC33_RUNNING &&
                   source->cycles - cpu_cycles == 1u &&
                   source->device_cycles - device_cycles == ratio,
               "DOZE ratio scales stepped peripheral cycles");
    }

    dspic33_reset(source, 0u);
    dspic33_write_word(source, MAIN_CLOCK_DIVISOR, 0x2800u);
    dspic33_load_program_word(source, 0u, OPCODE_GOTO_W0);
    dspic33_load_program_word(source, 0x0100u, OPCODE_NOP);
    dspic33_set_working_register(source, 0u, 0x0100u);
    dspic33_schedule(source, DSPIC33_EVENT_INTERRUPT, 0u, 0u, 15u);
    source->pc = 0u;
    cpu_cycles = source->cycles;
    device_cycles = source->device_cycles;
    expect(state,
           dspic33_step(source) == DSPIC33_RUNNING && source->pc == 0x0100u &&
               source->cycles - cpu_cycles == 4u &&
               source->device_cycles - device_cycles == 16u &&
               (dspic33_read_word(source, 0x0800u) & 1u) != 0u &&
               source->events.count == 0u,
           "DOZE scales multi-cycle instructions across device events");

    dspic33_reset(source, 0u);
    dspic33_write_word(source, MAIN_CLOCK_DIVISOR, 0x2800u);
    dspic33_load_program_word(source, 0u, OPCODE_MOV_IFS0_W2);
    dspic33_write_word(source, 0x0800u, 0x1234u);
    source->pc = 0u;
    cpu_cycles = source->cycles;
    device_cycles = source->device_cycles;
    expect(state,
           dspic33_step(source) == DSPIC33_RUNNING && source->w[2] == 0x1234u &&
               source->cycles - cpu_cycles == 2u &&
               source->device_cycles - device_cycles == 8u,
           "DOZE scales the separated non-CPU SFR wait cycle");

    dspic33_reset(source, 0u);
    dspic33_load_program_word(source, 0u, OPCODE_MOV_W0_W1);
    dspic33_load_program_word(source, 2u, OPCODE_NOP);
    dspic33_set_working_register(source, 0u, 0x1800u);
    dspic33_set_working_register(source, 1u, MAIN_CLOCK_DIVISOR);
    cpu_cycles = source->cycles;
    device_cycles = source->device_cycles;
    expect(state,
           dspic33_step(source) == DSPIC33_RUNNING &&
               dspic33_read_word(source, MAIN_CLOCK_DIVISOR) == 0x1800u &&
               source->cycles - cpu_cycles == 1u &&
               source->device_cycles - device_cycles == 1u,
           "DOZEN setting instruction uses the previous ratio");
    device_cycles = source->device_cycles;
    expect(state,
           dspic33_step(source) == DSPIC33_RUNNING &&
               source->device_cycles - device_cycles == 2u,
           "instruction after DOZEN setting uses the new ratio");
    source->pc = 0u;
    dspic33_set_working_register(source, 0u, 0x1000u);
    device_cycles = source->device_cycles;
    expect(state,
           dspic33_step(source) == DSPIC33_RUNNING &&
               dspic33_read_word(source, MAIN_CLOCK_DIVISOR) == 0x1000u &&
               source->device_cycles - device_cycles == 2u,
           "DOZEN clearing instruction uses the previous ratio");
    device_cycles = source->device_cycles;
    expect(state,
           dspic33_step(source) == DSPIC33_RUNNING &&
               source->device_cycles - device_cycles == 1u,
           "instruction after DOZEN clearing returns to one-to-one");

    dspic33_reset(source, 0u);
    dspic33_write_word(source, MAIN_CLOCK_DIVISOR, 0x3800u);
    dspic33_write_word(source, TIMER1_COUNTER, 0u);
    dspic33_write_word(source, TIMER1_PERIOD, 0xffffu);
    dspic33_write_word(source, TIMER1_CONTROL, 0x8000u);
    dspic33_load_program_word(source, 0u, OPCODE_NOP);
    source->pc = 0u;
    source->disicnt = 5u;
    cpu_cycles = source->cycles;
    device_cycles = source->device_cycles;
    expect(state,
           dspic33_step(source) == DSPIC33_RUNNING &&
               source->cycles - cpu_cycles == 1u &&
               source->device_cycles - device_cycles == 8u && source->disicnt == 4u &&
               dspic33_read_word(source, TIMER1_COUNTER) == 8u,
           "DOZE keeps CPU state slow while peripherals run at full speed");
    cpu_cycles = source->cycles;
    device_cycles = source->device_cycles;
    expect(state,
           dspic33_device_advance(source, 1u) && source->cycles - cpu_cycles == 1u &&
               source->device_cycles - device_cycles == 1u &&
               dspic33_read_word(source, TIMER1_COUNTER) == 9u,
           "public device advance remains an equal-domain stimulus");

    dspic33_reset(source, 0u);
    dspic33_write_word(source, MAIN_CLOCK_DIVISOR, 0x3800u);
    dspic33_write_word(source, CRC_PMD_ADDRESS, CRC_PMD);
    expect(state,
           source->events.count == 1u &&
               source->events.items[0].cycle - source->device_cycles == 8u &&
               !source->io.crc.pmd_disabled,
           "DOZE scales one-instruction PMD transitions");
    expect(state, dspic33_device_advance(source, 7u) && !source->io.crc.pmd_disabled,
           "scaled PMD transition remains pending before its deadline");
    expect(state, dspic33_device_advance(source, 1u) && source->io.crc.pmd_disabled,
           "scaled PMD transition completes at one divided instruction");

    dspic33_reset(source, 0u);
    dspic33_write_word(source, MAIN_CLOCK_DIVISOR, 0x3800u);
    dspic33_load_program_word(source, 0u, OPCODE_MOV_W0_W1);
    dspic33_set_working_register(source, 0u, CRC_PMD);
    dspic33_set_working_register(source, 1u, CRC_PMD_ADDRESS);
    source->pc = 0u;
    device_cycles = source->device_cycles;
    expect(state,
           dspic33_step(source) == DSPIC33_RUNNING && source->io.crc.pmd_disabled &&
               source->device_cycles - device_cycles == 8u &&
               source->events.count == 0u,
           "stepped PMD write completes after one divided instruction");

    dspic33_reset(source, 0u);
    dspic33_write_word(source, MAIN_CLOCK_DIVISOR, 0x1800u);
    configure_doze_interrupt(source, 1u);
    source->pc = 0u;
    device_cycles = source->device_cycles;
    expect(state,
           dspic33_step(source) == DSPIC33_RUNNING && source->last_interrupt == 0u &&
               source->pc == 0x0102u &&
               (dspic33_read_word(source, MAIN_CLOCK_DIVISOR) &
                MAIN_CLOCK_DOZE_ENABLE) != 0u &&
               source->device_cycles - device_cycles == 2u,
           "interrupt preserves DOZE when ROI is clear");

    dspic33_reset(source, 0u);
    dspic33_write_word(source, MAIN_CLOCK_DIVISOR,
                       MAIN_CLOCK_RECOVER_INTERRUPT | 0x1800u);
    configure_doze_interrupt(source, 1u);
    source->pc = 0u;
    device_cycles = source->device_cycles;
    expect(state,
           dspic33_step(source) == DSPIC33_RUNNING && source->last_interrupt == 0u &&
               source->pc == 0x0102u &&
               (dspic33_read_word(source, MAIN_CLOCK_DIVISOR) &
                MAIN_CLOCK_DOZE_ENABLE) == 0u &&
               source->device_cycles - device_cycles == 1u,
           "ROI clears DOZEN before the first handler instruction");

    dspic33_reset(source, 0u);
    dspic33_write_word(source, MAIN_CLOCK_DIVISOR,
                       MAIN_CLOCK_RECOVER_INTERRUPT | 0x1800u);
    configure_doze_interrupt(source, 1u);
    source->sr = 0x0020u;
    source->power_state = DSPIC33_POWER_IDLE;
    expect(state,
           dspic33_device_wake(source) && source->interrupt_count == 0u &&
               (dspic33_read_word(source, MAIN_CLOCK_DIVISOR) &
                MAIN_CLOCK_DOZE_ENABLE) == 0u &&
               (dspic33_read_word(source, 0x0800u) & 1u) != 0u,
           "ROI clears DOZEN on a wake-only interrupt");

    dspic33_reset(source, 0u);
    dspic33_write_word(source, MAIN_CLOCK_DIVISOR,
                       MAIN_CLOCK_RECOVER_INTERRUPT | 0x1800u);
    configure_doze_interrupt(source, 1u);
    source->sr = 0x0020u;
    source->power_state = DSPIC33_POWER_IDLE;
    source->pc = 0u;
    dspic33_load_program_word(source, 0u, OPCODE_NOP);
    device_cycles = source->device_cycles;
    expect(state,
           dspic33_step(source) == DSPIC33_RUNNING &&
               source->power_state == DSPIC33_POWER_ACTIVE &&
               source->interrupt_count == 0u && source->pc == 2u &&
               (dspic33_read_word(source, MAIN_CLOCK_DIVISOR) &
                MAIN_CLOCK_DOZE_ENABLE) == 0u &&
               source->device_cycles - device_cycles == 1u,
           "wake-only ROI resumes stepped execution at one-to-one");

    dspic33_reset(source, 0u);
    dspic33_write_word(source, MAIN_CLOCK_DIVISOR,
                       MAIN_CLOCK_RECOVER_INTERRUPT | 0x1800u);
    dspic33_load_program_word(source, 0u, OPCODE_NOP);
    source->pc = 0u;
    dspic33_raise_interrupt(source, 0u);
    device_cycles = source->device_cycles;
    expect(state,
           dspic33_step(source) == DSPIC33_RUNNING && source->interrupt_count == 0u &&
               (dspic33_read_word(source, MAIN_CLOCK_DIVISOR) &
                MAIN_CLOCK_DOZE_ENABLE) != 0u &&
               source->device_cycles - device_cycles == 2u,
           "masked interrupt does not recover from DOZE");

    dspic33_reset(source, 0u);
    dspic33_write_word(source, MAIN_CLOCK_DIVISOR,
                       MAIN_CLOCK_RECOVER_INTERRUPT | 0x1800u);
    configure_doze_interrupt(source, 0u);
    source->pc = 0u;
    expect(state,
           dspic33_step(source) == DSPIC33_RUNNING && source->interrupt_count == 0u &&
               (dspic33_read_word(source, MAIN_CLOCK_DIVISOR) &
                MAIN_CLOCK_DOZE_ENABLE) != 0u,
           "priority-zero interrupt does not recover from DOZE");

    dspic33_reset(source, 0u);
    dspic33_write_word(source, MAIN_CLOCK_DIVISOR,
                       MAIN_CLOCK_RECOVER_INTERRUPT | 0x1800u);
    configure_doze_interrupt(source, 1u);
    source->pc = 0u;
    source->sr = 0x0020u;
    expect(state,
           dspic33_step(source) == DSPIC33_RUNNING && source->interrupt_count == 0u &&
               (dspic33_read_word(source, MAIN_CLOCK_DIVISOR) &
                MAIN_CLOCK_DOZE_ENABLE) != 0u,
           "IPL-blocked interrupt does not recover from DOZE");

    dspic33_reset(source, 0u);
    dspic33_write_word(source, MAIN_CLOCK_DIVISOR,
                       MAIN_CLOCK_RECOVER_INTERRUPT | 0x1800u);
    configure_doze_interrupt(source, 1u);
    source->pc = 0u;
    source->interrupt_deferred[0] = 1u;
    expect(state,
           dspic33_step(source) == DSPIC33_RUNNING && source->interrupt_count == 0u &&
               (dspic33_read_word(source, MAIN_CLOCK_DIVISOR) &
                MAIN_CLOCK_DOZE_ENABLE) != 0u,
           "deferred interrupt does not recover from DOZE");

    dspic33_reset(source, 0u);
    dspic33_write_word(source, MAIN_CLOCK_DIVISOR,
                       MAIN_CLOCK_RECOVER_INTERRUPT | 0x1800u);
    configure_doze_interrupt(source, 1u);
    dspic33_write_word(source, 0x08c2u, 0u);
    source->pc = 0u;
    expect(state,
           dspic33_step(source) == DSPIC33_RUNNING && source->interrupt_count == 0u &&
               (dspic33_read_word(source, MAIN_CLOCK_DIVISOR) &
                MAIN_CLOCK_DOZE_ENABLE) != 0u,
           "GIE-disabled interrupt does not recover from DOZE");

    dspic33_reset(source, 0u);
    dspic33_write_word(source, MAIN_CLOCK_DIVISOR,
                       MAIN_CLOCK_RECOVER_INTERRUPT | 0x1800u);
    dspic33_load_program_word(source, 0x0008u, 0x0100u);
    dspic33_load_program_word(source, 0x0100u, OPCODE_NOP);
    dspic33_set_working_register(source, 15u, 0x1800u);
    dspic33_write_word(source, 0x08c6u, 1u);
    source->pc = 0u;
    device_cycles = source->device_cycles;
    trap_result = dspic33_step(source);
    expect(state,
           trap_result == DSPIC33_TRAPPED && source->last_trap == 2u &&
               source->pc == 0x0102u &&
               (dspic33_read_word(source, MAIN_CLOCK_DIVISOR) &
                MAIN_CLOCK_DOZE_ENABLE) != 0u &&
               source->device_cycles - device_cycles == 2u,
           "trap entry does not recover from DOZE");

    dspic33_reset(source, 0u);
    dspic33_write_word(source, MAIN_CLOCK_DIVISOR, 0x3800u);
    expect(state, dspic33_copy(copy, source), "copy preserves DOZE state");
    expect(state, dspic33_read_word(copy, MAIN_CLOCK_DIVISOR) == 0x3800u,
           "copy retains the selected DOZE ratio");
    dspic33_load_program_word(source, 0u, OPCODE_RESET);
    source->pc = 0u;
    device_cycles = source->device_cycles;
    expect(state,
           dspic33_step(source) == DSPIC33_RUNNING &&
               dspic33_read_word(source, MAIN_CLOCK_DIVISOR) == 0x3800u &&
               source->device_cycles - device_cycles == 8u,
           "warm reset preserves DOZE and finishes at the old ratio");
    dspic33_reset(copy, 0u);
    expect(state, dspic33_read_word(copy, MAIN_CLOCK_DIVISOR) == 0x3040u,
           "POR restores the configured clock divisor");

    dspic33_reset(source, 0u);
    dspic33_write_word(source, MAIN_CLOCK_DIVISOR, 0x7800u);
    dspic33_load_program_word(source, 0u, OPCODE_NOP);
    source->pc = 0u;
    source->device_cycles = UINT64_MAX - 100u;
    cpu_cycles = source->cycles;
    device_cycles = source->device_cycles;
    expect(state,
           dspic33_step(source) == DSPIC33_EVENT_QUEUE_ERROR &&
               source->cycles == cpu_cycles && source->device_cycles == device_cycles,
           "DOZE device-cycle overflow reports an event error without clock advance");
}

static void lifecycle_cases(OscillatorConformance* state, Dspic33* source,
                            Dspic33* copy) {
    dspic33_reset(source, 0u);
    write_protected_byte(source, OSCILLATOR_CONTROL + 1u, 0x03u);
    write_protected_byte(source, OSCILLATOR_CONTROL, OSCILLATOR_SWITCH_ENABLE);
    dspic33_device_advance(source, 10u);
    expect(state, dspic33_copy(copy, source), "copy preserves oscillator state");
    expect(state,
           copy->oscillator.active &&
               copy->oscillator.generation == source->oscillator.generation,
           "copy preserves active oscillator generation");
    expect(state, copy->events.count == source->events.count,
           "copy preserves pending oscillator event");
    expect(state, dspic33_device_advance(source, 22u) && control(source) == 0x3320u,
           "source completes copied switch interval");
    expect(state, dspic33_device_advance(copy, 22u) && control(copy) == 0x3320u,
           "copy independently completes switch interval");

    dspic33_reset(source, 0u);
    write_protected_byte(source, OSCILLATOR_CONTROL + 1u, 0x03u);
    write_protected_byte(source, OSCILLATOR_CONTROL, OSCILLATOR_SWITCH_ENABLE);
    dspic33_device_advance(source, 10u);
    dspic33_load_program_word(source, 0u, OPCODE_RESET);
    source->pc = 0u;
    expect(state, dspic33_step(source) == DSPIC33_RUNNING,
           "warm reset executes during oscillator switch");
    expect(state, control(source) == 0x0301u && source->oscillator.active,
           "warm reset preserves active oscillator switch");
    expect(state, source->events.count == 1u,
           "warm reset reconstructs pending oscillator event");
    expect(state, source->events.items[0].cycle - source->device_cycles == 20u,
           "warm reset preserves remaining oscillator interval");
    expect(state, dspic33_device_advance(source, 19u) && control(source) == 0x0301u,
           "warm-reset switch remains pending before preserved deadline");
    expect(state, dspic33_device_advance(source, 1u) && control(source) == 0x3320u,
           "warm-reset switch completes at preserved deadline");

    dspic33_reset(source, 0u);
    write_protected_byte(source, OSCILLATOR_CONTROL + 1u, 0x03u);
    write_protected_byte(source, OSCILLATOR_CONTROL, OSCILLATOR_SWITCH_ENABLE);
    dspic33_device_advance(source, 10u);
    dspic33_reset(source, 0u);
    expect(state, control(source) == 0u, "POR resets OSCCON from configuration");
    expect(state, !source->oscillator.active && source->events.count == 0u,
           "POR cancels pending oscillator switch");
    expect(state, dspic33_device_advance(source, 32u) && control(source) == 0u,
           "POR prevents stale oscillator completion");

    dspic33_reset(source, 0u);
    write_protected_byte(source, OSCILLATOR_CONTROL + 1u, 0x03u);
    load_sequence(source, OPCODE_MOV_BYTE_W2_W1, OPCODE_MOV_BYTE_W3_W1,
                  OPCODE_MOV_BYTE_W0_W1);
    source->pc = 0x0020u;
    dspic33_set_working_register(source, 0u, OSCILLATOR_SWITCH_ENABLE);
    dspic33_set_working_register(source, 1u, OSCILLATOR_CONTROL);
    dspic33_set_working_register(source, 2u, 0x46u);
    dspic33_set_working_register(source, 3u, 0x57u);
    dspic33_step(source);
    dspic33_step(source);
    source->device_cycles = UINT64_MAX;
    dspic33_step(source);
    expect(state, source->stop_reason == DSPIC33_EVENT_QUEUE_ERROR,
           "switch schedule overflow reports event error");
    expect(state, control(source) == 0x0301u && source->events.count == 0u,
           "failed schedule leaves requested switch state visible");

    dspic33_reset(source, 0u);
    load_sequence(source, OPCODE_MOV_BYTE_W2_W1, OPCODE_RESET, OPCODE_MOV_BYTE_W3_W1);
    dspic33_load_program_word(source, 0x0026u, OPCODE_MOV_BYTE_W0_W1);
    source->pc = 0x0020u;
    dspic33_set_working_register(source, 0u, 0x40u);
    dspic33_set_working_register(source, 1u, OSCILLATOR_CONTROL);
    dspic33_set_working_register(source, 2u, 0x46u);
    dspic33_set_working_register(source, 3u, 0x57u);
    expect(state, dspic33_step(source) == DSPIC33_RUNNING,
           "reset invalidation first key executes");
    expect(state, dspic33_step(source) == DSPIC33_RUNNING,
           "reset executes between protected keys");
    source->pc = 0x0024u;
    expect(state, dspic33_step(source) == DSPIC33_RUNNING,
           "post-reset second key executes");
    expect(state, dspic33_step(source) == DSPIC33_RUNNING,
           "post-reset final write executes");
    expect(state, (control(source) & OSCILLATOR_IO_LOCK) == 0u,
           "reset invalidates protected key sequence");
}

int main(void) {
    Dspic33 source;
    Dspic33 copy;
    OscillatorConformance state = {0u, 0u, 0u};
    if (!dspic33_initialize(&source) || !dspic33_initialize(&copy)) {
        fprintf(stderr, "failed to initialize simulator\n");
        return 2;
    }
    dspic33_load_configuration_word(&source, 0xf80008u, 0x005eu);
    reset_cases(&state, &source);
    protection_cases(&state, &source);
    switch_cases(&state, &source);
    failure_trap_cases(&state, &source);
    configuration_admission_cases(&state, &source);
    hardware_failure_cases(&state, &source);
    pll_lock_sequence_cases(&state, &source, &copy);
    two_speed_startup_cases(&state, &source, &copy);
    reference_clock_cases(&state, &source, &copy);
    main_pll_configuration_cases(&state, &source, &copy);
    doze_cases(&state, &source, &copy);
    lifecycle_cases(&state, &source, &copy);
    expect(&state, state.cases == 317u, "oscillator assertion arithmetic");
    printf("[oscillator-summary] cases=%" PRIu32 " passed=%" PRIu32 " failed=%" PRIu32
           "\n",
           state.cases, state.passed, state.failed);
    dspic33_destroy(&copy);
    dspic33_destroy(&source);
    return state.failed == 0u ? 0 : 1;
}
